clautolisp/documentation/aldo-debugger-interaction.puml
@startuml aldo-debugger-interaction
title Aldo debugger interaction

' left-to-right order
participant terminal
participant "aldo\ndebugger thread" as aldo
participant "autolisp\nmain thread"   as main

terminal -> main : Interruption (C-c)
main -> main : invoke-debugger-at-next-poll-point
main -> aldo : invoke-debugger
activate main

loop n times
  aldo -> terminal : print menu
  terminal -> aldo : input debugging command
  aldo -> aldo : execute command
end

aldo -> main : step in
deactivate main

main -> aldo : stepped in
activate main

loop n times
  aldo -> terminal : print menu
  terminal -> aldo : input debugging command
  aldo -> aldo : execute command
end

aldo -> main : continue
deactivate main
@enduml
